
#This search is to detect a suspicious attachment file extension in Gsuite email that may related to spear phishing attack. This file type is commonly used by malware to lure user to click on it to execute malicious code to compromised targetted machine. But this search can also catch some normal files related to this file type that maybe send by employee or network admin.

#Splunk Reference: https://research.splunk.com/cloud/6d663014-fe92-11eb-ab07-acde48001122/
#MITRE Reference:
#  https://attack.mitre.org/techniques/T1566/001/
#  https://attack.mitre.org/techniques/T1566/

index=google sourcetype=gws:gmail "message_info.num_message_attachments">0 "message_info.attachment{}.file_extension_type" IN ("pkg", "app", "dmg", "sh", "exec", "bash", "pl", "rb", "py", "rb", "sh", "bat", "exe", "dll", "cpl", "com", "js", "vbs", "ps1", "reg", "swf", "cmd", "go") 
| where "message_info.destination{}.address"!="message_info.source.address"
| stats count min(_time) as firstTime max(_time) as lastTime values(message_info.attachment{}.file_extension_type) as email_attachments, values(message_info.attachment{}.sha256) as attachment_sha256, values(message_info.payload_size) as payload_size by message_info.destination{}.service message_info.num_message_attachments  message_info.subject message_info.destination{}.address message_info.source.address
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)`
