index=aws 
sourcetype="aws:cloudtrail"
eventName=UpdateDetector
eventSource="guardduty.amazonaws.com" 
| table _time, eventSource, eventName, src_ip, userIdentity.arn, userIdentity.accountId, userIdentity.accessKeyId
