
#Newly created GuardDuty findings can be automatically archived via Suppression Rules. An adversary could use filters to automatically archive findings they are likely to generate. 
#Suppression Rules: https://docs.aws.amazon.com/guardduty/latest/ug/findings_suppression-rule.html
#Filters: https://docs.aws.amazon.com/guardduty/latest/ug/guardduty_filter-findings.html

index=aws 
sourcetype=aws:cloudtrail
eventSource="guardduty.amazonaws.com" 
eventName=CreateFilter
| table _time, eventSource, eventName, src_ip, userIdentity.arn, userIdentity.accountId, userIdentity.accessKeyId


