
#This analytic identifies multiple failed logon attempts from a single IP. Use this analytic to identify patterns of suspicious logins from a single source and filter as needed or use this to drive tuning for higher fidelity analytics. 


#splunk reference: https://research.splunk.com/application/19cba45f-cad3-4032-8911-0c09e0444552/
#MITRE Reference: 
#  https://attack.mitre.org/techniques/T1078/
#  https://attack.mitre.org/techniques/T1078/001/

index=okta outcome.reason=INVALID_CREDENTIALS NOT src_ip IN (8.29.109.79, 216.200.155.244, 107.20.83.18, 52.5.151.179, 8.29.228.71, 185.114.121.134, 149.20.205.129, 140.82.201.18, 209.206.31.129, 45.62.188.11, 140.82.197.77, 103.83.225.4, 203.28.67.94, 222.127.18.234, 27.110.214.12, 58.69.30.146)
| rename client.geographicalContext.country as country, client.geographicalContext.state as state, client.geographicalContext.city as city 
| stats min(_time) as firstTime max(_time) as lastTime dc(src_user) as distinct_users values(src_user) as users by src_ip, displayMessage, outcome.reason, country, state, city 
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` 
| bin _time span=1d
| search distinct_users > 5
| `multiple_okta_users_with_invalid_credentials_from_the_same_ip_filter`


#TUNING: 
#  I don't think my |bin command is working properly. Need to ask hurricane. 
#  Definitely a lot of IPs filtered out. Maybe consider making that a lookup table for allowed IPs and noting what each one is. 

#Known False Positives
#A single public IP address servicing multiple legitmate users may trigger this search. In addition, the threshold of 5 distinct users may be too low for your needs. You may modify the included filter macro multiple_okta_users_with_invalid_credentials_from_the_same_ip_filter to raise the threshold or except specific IP adresses from triggering this search.
