
#It shows that there have been an unsuccessful attempt to log in using the user identity to the AWS management console. Since the user identity has access to AWS account services and resources, an attacker might try to brute force the password for that identity.

#Reference: https://research.splunk.com/cloud/a19b354d-0d7f-47f3-8ea6-1a7c36434968/
#MITRE: 
#  https://attack.mitre.org/techniques/T1586/
#  https://attack.mitre.org/techniques/T1586/003/
#  https://attack.mitre.org/techniques/T1110/
#  https://attack.mitre.org/techniques/T1110/001/

| tstats count earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Authentication where Authentication.action = failure Authentication.app=AwsConsoleSignIn Authentication.signature=ConsoleLogin BY Authentication.app Authentication.signature Authentication.dest  Authentication.user Authentication.action Authentication.user_id Authentication.src 
| where count > 4
| `drop_dm_object_name(Authentication)`  
| `security_content_ctime(firstTime)`
|  `security_content_ctime(lastTime)`

#NEEDS TUNING: I would like to add the bin command to lower the timeframe to 30 minutes (so |bin span=30m _time) but I believe by renaming the _time fields in the initial search, that command doesn't function properly. Need to ask HL. 
