
#This analytic looks for one or more policy evaluation events in which multiple client values (IP, User Agent, etc.) change associated to the same Device Token for a specific user. A detection opportunity arises when an adversary attempts to reuse a stolen web session cookie. It retrieves policy evaluation events from successful authentication events, aggregates/Groups by Device Token and User, providing the first policy evaluation event in the search window, and then evaluates whether there is more than one IP and whether there is more than one OS or browser for each combination of User/Device Token.
#Reference: https://research.splunk.com/application/71ad47d1-d6bd-4e0a-b35c-020ad9a6959e/
#Okta Reference: https://sec.okta.com/shareddetections
#MITRE Technique: T1539 https://attack.mitre.org/techniques/T1539/

index=okta 
eventType IN (policy.evaluate_sign_on) outcome.result IN (ALLOW, SUCCESS) 
| stats earliest(_time) as _time values(client.ipAddress) as src_ip values(client.userAgent.rawUserAgent) as user_agent values(client.userAgent.os) as userAgentOS_list values(client.geographicalContext.city) as city values(client.userAgent.browser) as userAgentBrowser_list values(device.os_platform) as okta_device_os dc(client.userAgent.browser) as dc_userAgentBrowser dc(client.userAgent.os) as dc_userAgentOS dc(client.ipAddress) as dc_src_ip values(outcome.reason) as reason by debugContext.debugData.dtHash actor.alternateId 
| where dc_src_ip>1 AND (dc_userAgentOS>1 OR dc_userAgentBrowser>1) 



#``` If we see different Operating Systems or Browsers from a UserAccount using with the same DTHash ```
#| where dc_src_ip>1 AND (dc_userAgentOS>1 OR dc_userAgentBrowser>1)

#Adding this macro to the end allows the user to filter out any results (false positives) without editing the SPL.
#| `okta_suspicious_use_of_a_session_cookie_filter`
