
#Searches for multiple push failures by user

index=okta
eventType="user.authentication.auth_via_mfa" AND outcome.result="FAILURE"
outcome.reason="INVALID_CREDENTIALS" 
debugContext.debugData.factor="OKTA_VERIFY_PUSH"
| stats count, values(client.ipAddress) AS src_ip, values(client.geographicalContext.country) AS src_country by actor.alternateId
| where count > 4
| rename actor.alternateId AS user
